/**
 * Created by zzj on 2016/7/14.
 */
var data=[];
var dataStr='1、老婆，我爱你<br><br>不知道这是哪<br>老婆，我爱你' +
    '<br><br><br>2、小傻<br><br>东秦的春天，还有小傻<br>老婆，我爱你' +
    '<br><br><br>3、小本的生日<br><br>小傻陪小笨过的第一个生日，泪流满面，为笨唱了一首情歌，找人给笨发送祝福，陪笨吃了西餐，给笨买了蛋糕。。。别人眼里，我们满是幸福<br>老婆，我爱你' +
    '<br><br><br>4、小笨生日<br><br>感动<br>老婆，我爱你' +
    '<br><br><br>5、稻草人<br><br>小傻以为我喜欢特意陪小笨来的，笨脾气不好，笨的错<br>老婆，我爱你' +
    '<br><br><br>6、稻草人<br><br>稻草人<br>老婆，我爱你' +
    '<br><br><br>7、稻草人<br><br>小傻宝贝好看<br>老婆，我爱你' +
    '<br><br><br>8、小笨傻了<br><br>小笨又是一张傻傻的表情<br>老婆，我爱你' +
    '<br><br><br>9、唐山世博园<br><br>陪小傻去考试，运气不好，知道成绩不好，笨担心，担心小傻心情不好，好在有这个世博园！<br>老婆，我爱你' +
    '<br><br><br>10、唐山世博园<br><br>这也是笨选的一个镜头，自我评价可以哈哈，关键人美<br>老婆，我爱你' +
    '<br><br><br>11、唐山世博园<br><br>这个时候是小傻最开心的时候<br>老婆，我爱你' +
    '<br><br><br>12、唐山世博园<br><br>傻傻的，我喜欢<br>老婆，我爱你' +
    '<br><br><br>13、小笨<br><br>小傻让这么做的<br>老婆，我爱你' +
    '<br><br><br>14、笨<br><br>小笨的超级难看的姿势<br>老婆，我爱你' +
    '<br><br><br>15、笨<br><br>不说话<br>老婆，我爱你' +
    '<br><br><br>16、小傻<br><br>还是小傻的姿势好看<br>老婆，我爱你' +
    '<br><br><br>17、小傻<br><br>哈哈<br>老婆，我爱你' +
    '<br><br><br>18、小公园<br><br>拿着伞，小傻更美<br>老婆，我爱你' +
    '<br><br><br>19、海边<br><br>笨的错，本来听小傻的在学校租双人骑就好了，可是笨笨的笨不停，死倔，小傻还是陪着小笨在海边走了一圈，有小傻如此，夫复何求！！！<br>老婆，我爱你' +
    '<br><br><br>20、海边<br><br>景色不错，小笨背着小傻的包<br>老婆，我爱你' ;
var d=dataStr.split('<br><br><br>');
for(var i=0;i<d.length;i++){
    var c=d[i].split('<br><br>');
    data.push({
        img:c[0].split('、')[0]+'.jpg',
        caP:c[0].split('、')[1],
        desc:c[1]
    });
}